Autodesk.Revit.DB.OrdinateOriginVisibility.WitnessLineOnly
the ordinate origin visibility with witness line only

Autodesk.Revit.DB.OrdinateOriginVisibility.WitnessLineWithText
the ordinate origin visibility of witness line with text

Autodesk.Revit.DB.OrdinateOriginVisibility.None
the invalid ordinate origin visibility